app/controllers/api/v1/calendars_controller.rb

  def index
    @calendars = Calendar.all
---
SELECT "calendars".* FROM "calendars"

  def show
    @calendar = Calendar.find(params[:id])
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @calendar = Calendar.create(calendar_params)
---
INSERT INTO "calendars" ("start_date", "end_date", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["start_date", "2018/09/14"], ["end_date", "2018/09/12"], ["title", "Birthday"], ["created_at", "2018-12-05 14:08:47.518065"], ["updated_at", "2018-12-05 14:08:47.518065"]]